; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph1 - mode
	thermograph0 - mode
	thermograph2 - mode
	GroundStation4 - direction
	GroundStation6 - direction
	Star8 - direction
	Star9 - direction
	Star0 - direction
	GroundStation1 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	Star11 - direction
	Star2 - direction
	GroundStation13 - direction
	Star14 - direction
	Star5 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation12)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star11)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Phenomenon15)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 thermograph2)
	(have_image Planet17 thermograph2)
	(have_image Planet18 thermograph1)
	(have_image Planet19 thermograph2)
	(have_image Star20 thermograph0)
	(have_image Planet21 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation13 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 groundstation13)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation13)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 planet19 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 planet19)
   goals met: 0 of 9
5. (take_image satellite1 planet19 instrument2 thermograph2)
   added: (have_image planet19 thermograph2)
   goals met: 1 of 9
6. (turn_to satellite1 planet17 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 planet17)
   goals met: 1 of 9
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 9
8. (calibrate satellite0 instrument1 groundstation12)
   added: (calibrated instrument1)
   goals met: 1 of 9
9. (take_image satellite1 planet17 instrument2 thermograph2)
   added: (have_image planet17 thermograph2)
   goals met: 2 of 9
10. (turn_to satellite0 phenomenon15 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 9
11. (take_image satellite0 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 3 of 9
12. (turn_to satellite0 planet18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet18)
   goals met: 3 of 9
13. (take_image satellite0 planet18 instrument1 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 4 of 9
14. (turn_to satellite0 star20 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star20)
   goals met: 4 of 9
15. (take_image satellite0 star20 instrument1 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 5 of 9
16. (turn_to satellite0 star5 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star5)
   goals met: 6 of 9
17. (turn_to satellite1 planet21 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet21)
   goals met: 6 of 9
18. (take_image satellite1 planet21 instrument2 thermograph2)
   added: (have_image planet21 thermograph2)
   goals met: 7 of 9
19. (turn_to satellite1 star16 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star16)
   goals met: 7 of 9
20. (take_image satellite1 star16 instrument2 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 8 of 9
21. (turn_to satellite1 phenomenon15 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 phenomenon15)
   goals met: 9 of 9
